locale = {
    "greeting": "Приветствую тебя, Герой!",
    "register": "Под каким именем хочешь идти в бой, герой? Введи его и начнем приключение:",
    "home": "Выбери свой следующий шаг!",
    "tower": "Тут ты можешь сразиться с разнообразными NPC. Пройди через этажи, начиная с самых легких и заканчивая самыми сложными противниками - выбор за тобой:",
    "distribution": "У тебя есть несколько свободных очков. Выбирай, какую характеристику ты будешь усиливать:",
    "revival": "Ты воскрес, как Феникс, готовый к новым подвигам. Не забывай беречь свои жизни.",
    "equip": "Экипировка - твой союзник в битве. Здесь ты найдешь свое текущее оружие, броню, артефакты.",
    "inventory": "Рюкзак вмещает предметы необходимые в путешествии.\n",
    "shop": "Здесь магия витает в воздухе, как и обещание неведомого..",
    "hunt": "Дневник охотника недоступен без лицензии, но не беда! Даже в тени охотника можно найти свой след.",
    "top": "Топ игроков:",
    "skills_select": "Здесь можно выбрать навыки, которые будут доступны в бою:",
    "arena": "Вы можете бросить вызов другому охотнику или группе охотников.",
    "town": "Вы в городе:",
    "team": "Вы можете создать команду или вступить в существующую.",
    "team_accept": "Вы хотите вступить в группу?\n(Если у вас несколько заявок, то вы присоединитесь к последней.)",
    "distribution_tip": (
        f"Всего в игре семь характеристик:\n"
        f"*Сила* — Влияет на урон воинов\n"
        f"*Ловкость* — Влияет на урон лучников и убийц\n"
        f"*Меткость* — Влияет на точность лучников/магов, против быстрых противников\n"
        f"*Скорость* — Влияет на уклонение, точность, а так же первый ход\n"
        f"*Интеллект* — Влияет на урон магов, и доступную сложность заклинания\n"
        f"*Дух* — Влияет на количество маны и её регенерацию во время боя\n"
        f"*Меткость* — Дальникам будет идти в уклонение часть меткости и урон от этого параметра\n"
        f"*Приручение* — Необходимо для приручения питомцев\n"
    )
}
