locale = {
    "greeting": "Приветствую тебя, Герой!",
    "register": "Под каким именем хочешь идти в бой, герой? Введи его и начнем приключение:",
    "home": "Выбери свой следующий шаг!",
    "tower": "Тут ты можешь сразиться с разнообразными NPC. Пройди через этажи, начиная с самых легких и заканчивая самыми сложными противниками - выбор за тобой:",
    "campus": "Кампус.",
    "distribution": "У тебя есть несколько свободных очков. Выбирай, какую характеристику ты будешь усиливать:",
    "revival": "Ты воскрес, как Феникс, готовый к новым подвигам. Не забывай беречь свои жизни.",
    "equip": "Экипировка - твой союзник в битве. Здесь ты найдешь свое текущее оружие, броню, артефакты.",
    "inventory": "Рюкзак вмещает предметы необходимые в путешествии.\n",
    "shop": "Здесь магия витает в воздухе, как и обещание неведомого..",
    "hunt": "Дневник охотника недоступен без лицензии, но не беда! Даже в тени охотника можно найти свой след.",
    "top": "Топ игроков:",
    "skills_select": "Здесь можно выбрать Заклинания, которые будут доступны в бою:",
    "techniques_select": "Здесь можно выбрать Техники, которые будут доступны в бою:",
    "arena": "Вы можете бросить вызов другому охотнику или группе охотников.",
    "town": "Вы в городе:",
    "team": "Вы можете создать команду или вступить в существующую.",
    "team_accept": "Вы хотите вступить в группу?\n(Если у вас несколько заявок, то вы присоединитесь к последней.)",
    "distribution_tip": (
        f"Всего в игре семь характеристик:\n"
        f"`• Сила` — Увеличивает урон воинов\n"
        f"`• Здоровье` — Увеличивает количество хп\n"
        f"`• Ловкость` — Увеличивает урон лучников и убийц\n"
        f"`• Меткость` — Улучшает точность дистанционных техник\n"
        f"`• Скорость` — Влияет на уклонение, точность и первый ход.\n"
        f"`• Интеллект` — Увеличивает урон магов\n"
        f"`• Дух` — Увеличивает количество маны и её регенерацию\n"
        f"`• Приручение` — Необходимо для приручения питомцев\n"
        f"`• Контроль Маны` — Зависит от Духа/Интеллекта\n"
        f"`• Контроль Ки` — Зависит от Здоровья/Силы\n"
        f"(Контроль необходимо для активации техники и уменьшения затрат)"
    ),
    "error_repeat": 'Ошибка, попробуйте ещё раз, или напишите админам'
}

keyboard = {
    # Base
    'start': 'Начать',
    'back': '🔙 Назад',
    'next': 'Продолжить',
    'cancel': 'Отмена',
    'yes': 'Да',
    'no': 'Нет',
    'accept': 'Принять',
    'declined': 'Отклонить',
    'home': 'Домой',
    'reborn': 'Возрождение',
    # Location
    'location': '🚪 Локации',
    'character': '👤 Персонаж',
    'top': '🔝 Топ',
    'tower': '🛕 Башня небес',
    'campus': '🛕 Кампус сражений',
    'arena': '🏟 Арена',
    'training': '🕘 Тренировочная зона',
    'fortress': '🕘 Форт',
    'team': '🔰 Команды',
    'shop': '🧺 Торговая лавка',
    # Battle
    'battle_start': 'В бой',
    'pass': 'Пас',
    'technique_list': 'Техники',
    'spell_list': 'Заклинания',
    'evasion': 'Уворот',
    'defense': 'Защита',
    'contr_strike': 'Контрудар',
    'escape': 'Сбежать',
    # PVP
    'battle_solo': 'Одиночный бой',
    'battle_group': 'Командный бой',
    # Character distribution
    'strength': 'Сила',
    'health': 'Здоровье',
    'speed': 'Скорость',
    'dexterity': 'Ловкость',
    'accuracy': 'Меткость',
    'soul': 'Дух',
    'intelligence': 'Интеллект',
    'submission': 'Подчинение',
    # Character info
    'status': 'Статус',
    'statistic': 'Статистика',
    'status_full': 'Полный статус',
    'status_flat': 'Чистый статус',
    'race': 'Раса',
    'class': 'Класс',
    # Character
    'info': '📊 Информация',
    'equipment': '🧤 Экипировка',
    'inventory': '👝 Инвентарь',
    'distribution': '🎓 Распределение СО',
    'techniques': '🏵 Техники',
    # Equipment
    'weapon_current': 'Текущее оружие',
    'weapon': 'Оружие',
    'quest': 'Квестовые предметы',
    'other': 'Прочее',
    # Shop
    'buy_all': 'Купить всё',
}
